УТ_для_edt/src/DataProcessors/смартЗагрузкаСкладскихОрдеровИзАдмирал/смартЗагрузкаСкладскихОрдеровИзАдмирал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартЗагрузкаСкладскихОрдеровИзАдмирал</name>
  <attributes>
    <name>РаспоряжениеНаОтгрузку</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряжениеНаПоступление</name>
    <type>
      <types>DefinedType.РаспоряжениеНаПоступление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИДОрдера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код1С</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияАдмирал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ордера</name>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерОрдераВнешний</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОрдера</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРасходныхОрдеров</name>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>КОтбору</name>
  </enumValues>
  <enumValues>
    <name>КПроверке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеПроверки</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>КонтрольОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ДвижениеВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииВПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ОтборИзЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВРозницу</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектовДляРазборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектующихДляСборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНаВнутренниеНужды</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоВозвратуПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеИзлишков</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеНедостач</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеПорчи</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеРезультатовПересчетов</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуПомещениями</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоПриемка</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>Пересчет</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомплектующихПослеРазборки</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваПриемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоВозвратуОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПрочемуОприходованию</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСобранныхКомплектов</name>
  </enumValues>
  <enumValues>
    <name>РазмещениеВЯчейки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваровУстарел</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеМатериаловПриПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаПродукцииДляГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСВЕТИС</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/DataProcessors/смартЗагрузкаСкладскихОрдеровИзАдмирал/Forms/ФормаЗагрузкиРасходныхОрдеров/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Распоряжения") Тогда
		РаспоряженияНаОтгрузку.Загрузить(ПолучитьИзВременногоХранилища(Параметры.Распоряжения));
		ИсходныеДанные.Загрузить(ПолучитьИзВременногоХранилища(Параметры.Распоряжения));
	КонецЕсли;
	
	Если РаспоряженияНаОтгрузку.Количество() = 0 Тогда
		Сообщить("Нет данных по отгрузке !");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДатаОрдеров = ТекущаяДатаСеанса() - 86400;
	
	Элементы.РаспоряженияНаОтгрузку.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьДанныеАдмирал", Истина);
	
	ЗагрузкаСкладскихОперацийИзАдмирал(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ЗагрузкаСкладскихОперацийИзАдмирал(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаОтгрузкуПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьТоварыНаФормеПоСтрокеДанныхИзАдмирал();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаОтгрузкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаДанных = РаспоряженияНаОтгрузку.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(Строкаданных.Распоряжение) Тогда
		ПоказатьЗначение(, СтрокаДанных.Распоряжение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеИзАдмиралаЗагружатьПриИзменении(Элемент)
	
	Распоряжение = Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные.Распоряжение;
	НомерОрдераВнешний = Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные.НомерОрдераВнешний;
	ДатаОрдера = Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные.ДатаОрдера;
	Загружать = Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные.Загружать;
	
	УстановитьОтметкуЗагрузкиДанныхПоРаспоряжению(Распоряжение, НомерОрдераВнешний, ДатаОрдера, Загружать);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдера(Команда)
	
	СоздатьОрдераНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОрдеровПриИзменении(Элемент)
	
	ЗагрузкаСкладскихОперацийИзАдмирал(Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуЗагрузкиДанныхПоРаспоряжению(Распоряжение, НомерОрдераВнешний, ДатаОрдера, Загружать)
	
	НайденныеСтроки = Объект.Ордера.НайтиСтроки(Новый Структура("Распоряжение, НомерОрдераВнешний", Распоряжение, НомерОрдераВнешний));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденныеСтроки[0].Загружать = Загружать;
	Иначе
		
		НоваяСтрока = Объект.Ордера.Добавить();
		НоваяСтрока.Распоряжение = Распоряжение;
		НоваяСтрока.НомерОрдераВнешний = НомерОрдераВнешний;
		НоваяСтрока.ДатаОрдера = ДатаОрдера;
		НоваяСтрока.Загружать = Загружать;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого Идентификатор Из Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки Цикл
		
		стрДанные = РаспоряженияНаОтгрузку.НайтиПоИдентификатору(Идентификатор);
		стрДанные.Загружать = Истина;
		УстановитьОтметкуЗагрузкиДанныхПоРаспоряжению(стрДанные.Распоряжение, стрДанные.НомерОрдераВнешний, 
													  стрДанные.ДатаОрдера, стрДанные.Загружать);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для каждого Идентификатор Из Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки Цикл
		
		стрДанные = РаспоряженияНаОтгрузку.НайтиПоИдентификатору(Идентификатор);
		стрДанные.Загружать = Ложь;
		УстановитьОтметкуЗагрузкиДанныхПоРаспоряжению(стрДанные.Распоряжение, стрДанные.НомерОрдераВнешний, 
													  стрДанные.ДатаОрдера, стрДанные.Загружать);

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузкаСкладскихОперацийИзАдмирал(Принудительно = Ложь)
	
	РаспоряженияНаОтгрузку.Загрузить(ИсходныеДанные.Выгрузить());
	
	ДанныеАдмирал = Неопределено;
	КоличествоПопыток = 5;
	
	НомерПопытки = 0;
	Пока НомерПопытки < КоличествоПопыток Цикл
		
		НомерПопытки = НомерПопытки + 1;
		
		Попытка
			ДанныеАдмирал = смартИнтеграцияСАдмирал.ПолучитьРасходныеОрдераАдмирал(Формат(ДатаОрдеров, "ДФ=гггг-ММ-дд"));
			Прервать;
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
		
	Если НЕ ДанныеАдмирал = Неопределено И ДанныеАдмирал.Свойство("orders") Тогда
		
		Для каждого стрОрдер Из ДанныеАдмирал.orders Цикл
			
			ДатаОрдера = ПрочитатьДатуJSON(стрОрдер.date, ФорматДатыJSON.ISO);
			НомерОрдераВнешний = стрОрдер.number_int;
			НомерРаспоряжения = стрОрдер.number;
			Комментарий = стрОрдер.comment;
			Статус = стрОрдер.status;
			
			СтрокаНайдена = Ложь;
			Для каждого СтрокаДанных Из РаспоряженияНаОтгрузку Цикл
				
				НашНомер = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(СтрокаДанных.Распоряжение.Номер, Истина, Истина);
				Если СтрНайти(НомерРаспоряжения, НашНомер) > 0 Тогда
					СтрокаНайдена = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ СтрокаНайдена Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДанных.НомерРаспоряжения = НомерРаспоряжения;
			СтрокаДанных.НомерОрдераВнешний = НомерОрдераВнешний;
			СтрокаДанных.ДатаОрдера = ДатаОрдера;
			СтрокаДанных.Комментарий = Комментарий;
			СтрокаДанных.Статус = Статус;
			СтрокаДанных.Товары = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ЗаписатьОбъектВJSON(стрОрдер.goods);
			СтрокаДанных.ЕстьДанныеАдмирал = Истина;
			
			Ордер = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПолучитьРасходныйОрдерПоНомеруАдмирал(НомерОрдераВнешний, ДатаОрдера);
			
			Если ЗначениеЗаполнено(Ордер) Тогда
				СтрокаДанных.Ордер = Ордер;
			КонецЕсли;
			
			НайденныеСтроки = Объект.Ордера.НайтиСтроки(Новый Структура("Распоряжение, НомерОрдераВнешний", Распоряжение, НомерОрдераВнешний));
	
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаДанных.Загружать = НайденныеСтроки[0].Загружать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьТоварыНаФормеПоСтрокеДанныхИзАдмирал();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыНаФормеПоСтрокеДанныхИзАдмирал()
	
	ТоварыКЗагрузке.Очистить();
	
	Если Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанных = РаспоряженияНаОтгрузку.НайтиПоИдентификатору(Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока);
	
	Если СтрокаДанных <> Неопределено Тогда
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИДОрдера", СтрокаДанных.НомерОрдераВнешний));
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				НоваяСтрока = ТоварыКЗагрузке.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрНайденныеСтроки);
			КонецЦикла;
			
		Иначе
			
			ЗагрузитьТоварыИзАдмиралаПоСтроке(СтрокаДанных);
			
		КонецЕсли;
		
		Элементы.ТоварыКЗагрузкеКоличество.ТекстПодвала = Формат(ТоварыКЗагрузке.Итог("Количество"), "ЧДЦ=3");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТоварыИзАдмиралаПоСтроке(СтрокаДанных, ЗагрузитьВОбработку = Ложь)
	
	ТоварыИзАдмирал = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПрочитатьОбъектИзJSON(СтрокаДанных.Товары);
	Если ТипЗнч(ТоварыИзАдмирал) = Тип("Массив") Тогда
		
		Счетчик = 0;
				
		Для каждого стрТоварыИзАдмирал Из ТоварыИзАдмирал Цикл
			
			Если ЗагрузитьВОбработку Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.ИДОрдера = СтрокаДанных.НомерОрдераВнешний;
			Иначе
				Счетчик = Счетчик + 1;
				НоваяСтрока = ТоварыКЗагрузке.Добавить();
				НоваяСтрока.НомерСтроки = Счетчик;
			КонецЕсли;
			
			НоваяСтрока.ИД = стрТоварыИзАдмирал.product_id;
			НоваяСтрока.Код1С = стрТоварыИзАдмирал.product_id_ext;
			НоваяСтрока.Наименование = стрТоварыИзАдмирал.product_name;
			НоваяСтрока.СерияАдмирал = стрТоварыИзАдмирал.serial;
			НоваяСтрока.Количество = стрТоварыИзАдмирал.quantity;
			
			МассивКодАртикул = СтрРазделить(стрТоварыИзАдмирал.product_id_ext, ".", Истина);
			Если МассивКодАртикул.Количество() = 1 Тогда
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0]);
			ИначеЕсли МассивКодАртикул.Количество() = 2 Тогда
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0], МассивКодАртикул[1]);
			Иначе
				КодДляПоиска = МассивКодАртикул[МассивКодАртикул.Количество() - 1];
				АртикулДляПоиска = Лев(НоваяСтрока.Код1С, СтрДлина(НоваяСтрока.Код1С) - СтрДлина(КодДляПоиска) - 1);
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(АртикулДляПоиска, КодДляПоиска);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стрТоварыИзАдмирал.serial) И ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				НоваяСтрока.Серия = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиСериюНоменклатуры(НоваяСтрока.Номенклатура, стрТоварыИзАдмирал.serial);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				НоваяСтрока.НетСоответствия = Истина;
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.СерияАдмирал) И НЕ ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.НетСоответствия = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОрдераНаСервере()
	
	ТаблицаОрдеров = Объект.Ордера.Выгрузить(Новый Структура("Загружать", Истина));
	ТаблицаОрдеров.Свернуть("Распоряжение, НомерОрдераВнешний, ДатаОрдера");
	
	Для каждого стрТаблицаОрдеров Из ТаблицаОрдеров Цикл
		
		Если СоздатьОрдерНаСервере(стрТаблицаОрдеров.Распоряжение, стрТаблицаОрдеров.НомерОрдераВнешний, стрТаблицаОрдеров.ДатаОрдера) Тогда
			
			НайденныеСтроки = Объект.Ордера.НайтиСтроки(Новый Структура("Распоряжение,НомерОрдераВнешний,ДатаОрдера",
							 						    стрТаблицаОрдеров.Распоряжение, стрТаблицаОрдеров.НомерОрдераВнешний, стрТаблицаОрдеров.ДатаОрдера));
														
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				Объект.Ордера.Удалить(стрНайденныеСтроки);
			КонецЦикла;
			
		КонецЕсли;
													
	КонецЦикла;
	
	ЗагрузкаСкладскихОперацийИзАдмирал(Истина);
	
КонецПроцедуры

&НаСервере
Функция СоздатьОрдерНаСервере(РаспоряжениеЗагрузки, НомерОрдераВнешний, ДатаОрдера)
	
	Отказ = Ложь;
	НеПроводить = Ложь;
	Ордер = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПолучитьРасходныйОрдерПоНомеруАдмирал(НомерОрдераВнешний, ДатаОрдера);
	
	Если ЗначениеЗаполнено(Ордер) И Ордер.Проведен Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По распоряжению ""%1"" уже создан ордер %2. Создание не выполнено.", 
														РаспоряжениеЗагрузки, Ордер), Ордер);
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ордер) Тогда
		ОрдерОбъект = Ордер.ПолучитьОбъект();
	Иначе
		ОрдерОбъект = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	КонецЕсли;
	
	ОрдерОбъект.Дата = ТекущаяДатаСеанса();
	ОрдерОбъект.смартДатаОрдера = ДатаОрдера;
	ОрдерОбъект.смартИдентификаторWMS = НомерОрдераВнешний;
	
	ОрдерОбъект.Склад = Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение;
	ОрдерОбъект.ДатаОтгрузки = ОрдерОбъект.Дата;
	ОрдерОбъект.Комментарий = "Загружен по данным Адмирал";
	ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	ОрдерОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ОрдерОбъект.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	
	Если ТипЗнч(РаспоряжениеЗагрузки) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКлиенту;
		ОрдерОбъект.Получатель = РаспоряжениеЗагрузки.Партнер;
	ИначеЕсли ТипЗнч(РаспоряжениеЗагрузки) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению;
		ОрдерОбъект.Получатель = РаспоряжениеЗагрузки.СкладПолучатель;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение
	|	И ЗаданиеНаПеревозкуРаспоряжения.Склад = &Склад
	|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
	|	И НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Дата, ДЕНЬ) = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	|	РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	|	РаспоряженияКОтгрузке.Серия КАК Серия,
	|	РаспоряженияКОтгрузке.Назначение КАК Назначение,
	|	РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток КАК Количество,
	|	РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументОтгрузки = &Распоряжение) КАК РаспоряженияКОтгрузке
	|ГДЕ
	|	РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток > 0";
	
	Запрос.УстановитьПараметр("Склад", Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение);
	Запрос.УстановитьПараметр("Распоряжение", РаспоряжениеЗагрузки);
	Запрос.УстановитьПараметр("Дата", ДатаОрдеров);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ОрдерОбъект.ОтгрузкаПоЗаданиюНаПеревозку = Истина;
		ОрдерОбъект.ЗаданиеНаПеревозку = Выборка.Ссылка;
	КонецЕсли;
	
	Товары = Пакет[1].Выгрузить();
			
	Для каждого стрТовары Из Товары Цикл
		
		НоваяСтрока = ОрдерОбъект.ТоварыПоРаспоряжениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары);
		НоваяСтрока.Распоряжение = РаспоряжениеЗагрузки;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
			НоваяСтрока.СтатусУказанияСерий = 14;
		КонецЕсли;
		
		НоваяСтрока = ОрдерОбъект.ОтгружаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары);
		НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
			НоваяСтрока.СтатусУказанияСерий = 14;
		КонецЕсли;
		
	КонецЦикла;
		
	Если НЕ Отказ Тогда
		
		Попытка
			
			Если НЕ НеПроводить Тогда
				ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОрдерОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан ордер %1 по распоряжению %2", ОрдерОбъект.Ссылка, РаспоряжениеЗагрузки), ОрдерОбъект.Ссылка);
			
			Возврат Истина;
			
		Исключение
			
			Ошибка = ОписаниеОшибки();
			Сообщить(СтрШаблон("Не удалось провести ордер по распоряжению %1 по причине :%2%3", РаспоряжениеЗагрузки, Символы.ПС, Ошибка));
			
			Попытка
				ОрдерОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Ошибка = ОписаниеОшибки();
				Сообщить(СтрШаблон("Не удалось записать ордер по распоряжению %1 по причине :%2%3", РаспоряжениеЗагрузки, Символы.ПС, Ошибка));
			КонецПопытки;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Ложь;
			
КонецФункции

#КонецОбласти
